In [1]:
import pandas as pd
import numpy as np

In [2]:
# Retreiving my created.CSV to load into a DF to calculate average movie score.
data = pd.read_csv(r'C:\Users\brian\OneDrive\Desktop/movieratings.csv')
df_average = data

In [3]:
# Calculating average movie score, skipping NaN values.
df_average.mean(axis=0, skipna=True)

Pulp Fiction             4.500000
The Intouchables         4.750000
Goodfellas               4.000000
Leon The Professional    3.666667
Memento                  3.500000
Ingorious Basterds       4.000000
dtype: float64

In [4]:
# Creating a new DF for normalized calculations, removing NaN values and replacing with 0.
df_normalized = data
df_normalized.fillna(0)

,Name,Pulp Fiction,The Intouchables,Goodfellas,Leon The Professional,Memento,Ingorious Basterds
0,Leah,5.0,5.0,3.0,4.0,3.0,3.0
1,Rich,5.0,4.0,5.0,3.0,4.0,5.0
2,Lori,4.0,0.0,0.0,4.0,4.0,0.0
3,Zack,4.0,5.0,0.0,0.0,0.0,4.0
4,Nicole,0.0,5.0,0.0,0.0,3.0,0.0

In [5]:
# Was having a Str issue, this function converts all string values to integers.
def mapping(data,feature):
    featureMap=dict()
    count=0
    for i in sorted(data[feature].unique(),reverse=True):
        featureMap[i]=count
        count=count+1
    data[feature]=data[feature].map(featureMap)
    return data

In [6]:
# Non integer values fall in "Name" column, was unable to drop column from DF.
data=mapping(data,"Name")

In [7]:
# Normalized function for all data entries in entire DF.
df_normalized=((data-data.min())/(data.max()-data.min()))

In [8]:
display(df_normalized)

,Name,Pulp Fiction,The Intouchables,Goodfellas,Leon The Professional,Memento,Ingorious Basterds
0,1.00,1.0,1.0,0.0,1.0,0.0,0.0
1,0.25,1.0,0.0,1.0,0.0,1.0,1.0
2,0.75,0.0,NaN,NaN,1.0,1.0,NaN
3,0.00,0.0,1.0,NaN,NaN,NaN,0.5
4,0.50,NaN,1.0,NaN,NaN,0.0,NaN

## Using Normalization Vs. Actual Ratings

#### There are few advantages from what I can gather from our assignment to use normalization for these movie ratings. 
#### Normalization is used to transform multiple features to a similar scale, as all movie ratings are on a 1-5 scale and not compared with another feature - this doesnt provide us additional beneficial insight. If we were to compare two features such as age and salary, as both features are on a different scale (I.E: Age = 1-100, Income = 0-Jeff Bezos (billions)), this would be a better practical use of normalization. Standardization could be more applicable if we extended the scope of our assignment to include other films and use the mean and standard deviation of all ratings for comparison.